In [61]:
import pymysql as ms
import pymysql.cursors as msc
import pandas as pd
from typing import Any
from datetime import date, time
from helpers import *

In [62]:
def connect() -> "ms.Connection[msc.DictCursor]":
    return ms.connect(
        host="localhost",
        port=3306,
        user="root",
        password="root",
        database="university",
        autocommit=True,
        cursorclass=msc.DictCursor,
    )

In [63]:
def add_student(
    f_name: str | None,
    l_name: str | None,
    birth: date | None,
    address: str | None,
    email: str | None,
    phone: str | None,
    gender: str | None,
    first_term: int | None,
) -> int:
    with connect() as conn:
        with conn.cursor() as cur:
            return insert_one(
                cur,
                "Student",
                f_name=f_name,
                l_name=l_name,
                birth=birth,
                address=address,
                email=email,
                phone=phone,
                gender=gender,
                first_term=first_term,
            )

In [64]:
def add_professor(
    f_name: str | None,
    l_name: str | None,
    birth: date | None,
    address: str | None,
    email: str | None,
    phone: str | None,
    gender: str | None,
    title: str | None,
    office: int | None,
) -> int:
    with connect() as conn:
        with conn.cursor() as cur:
            return insert_one(
                cur,
                "Professor",
                f_name=f_name,
                l_name=l_name,
                birth=birth,
                address=address,
                email=email,
                phone=phone,
                gender=gender,
                title=title,
                office=office,
            )

In [65]:
def add_department(name: str | None):
    with connect() as conn:
        with conn.cursor() as cur:
            return insert_one(cur, "Department", name=name)

In [66]:
def add_major(name: str | None, department_id: int):
    with connect() as conn:
        with conn.cursor() as cur:
            return insert_one(cur, "Major", name=name, department_id=department_id)

In [67]:
def add_course(
    name: str | None, theoretical_units: int | None, practical_units: int | None
):
    with connect() as conn:
        with conn.cursor() as cur:
            return insert_one(
                cur,
                "Course",
                name=name,
                theoretical_units=theoretical_units,
                practical_units=practical_units,
            )

In [68]:
def add_course_group(
    term: int | None,
    classroom: int | None,
    week_day: int | None,
    start_time: time | None,
    end_time: time | None,
    professor_id: int,
    course_id: int,
):
    with connect() as conn:
        with conn.cursor() as cur:
            return insert_one(
                cur,
                "CourseGroup",
                term=term,
                classroom=classroom,
                week_day=week_day,
                start_time=start_time,
                end_time=end_time,
                professor_id=professor_id,
                course_id=course_id,
            )

In [69]:
def add_study(grade: int | float | None, student_id: int, course_group_id: int):
    with connect() as conn:
        with conn.cursor() as cur:
            return insert_one(
                cur,
                "Study",
                grade=grade,
                student_id=student_id,
                course_group_id=course_group_id,
            )

In [70]:
def add_enrollment(student_id: int, major_id: int):
    with connect() as conn:
        with conn.cursor() as cur:
            return insert_one(
                cur, "Enrollment", student_id=student_id, major_id=major_id
            )

In [71]:
def update_student_email(id: int, email: str | None):
    with connect() as conn:
        with conn.cursor() as cur:
            update(cur, "Student", id, email=email)

In [72]:
def update_professor_email(id: int, email: str | None):
    with connect() as conn:
        with conn.cursor() as cur:
            update(cur, "Professor", id, email=email)

In [73]:
def update_student_phone(id: int, phone: str | None):
    with connect() as conn:
        with conn.cursor() as cur:
            update(cur, "Student", id, phone=phone)

In [74]:
def update_professor_phone(id: int, phone: str | None):
    with connect() as conn:
        with conn.cursor() as cur:
            update(cur, "Professor", id, phone=phone)

In [75]:
def update_professor_title(id: int, title: str | None):
    with connect() as conn:
        with conn.cursor() as cur:
            update(cur, "Professor", id, title=title)

In [76]:
def update_professor_office(id: int, office: int | None):
    with connect() as conn:
        with conn.cursor() as cur:
            update(cur, "Professor", id, office=office)

In [77]:
def update_course_group_class(id: int, classroom: int | None):
    with connect() as conn:
        with conn.cursor() as cur:
            update(cur, "CourseGroup", id, classroom=classroom)

In [78]:
def update_course_group_time_slot(
    id: int, week_day: int | None, start_time: time | None, end_time: time | None
):
    with connect() as conn:
        with conn.cursor() as cur:
            update(
                cur,
                "CourseGroup",
                id,
                week_day=week_day,
                start_time=start_time,
                end_time=end_time,
            )

In [79]:
def update_course_group_professor(id: int, professor: int):
    with connect() as conn:
        with conn.cursor() as cur:
            update(cur, "CourseGroup", id, professor=professor)

In [80]:
def update_study_grade(id: int, grade: int | float | None):
    with connect() as conn:
        with conn.cursor() as cur:
            update(cur, "Study", id, grade=grade)

In [81]:
computer_department = add_department("Computer")
computer_department

1

In [82]:
computer_engineering_major = add_major("Computer Engineering", computer_department)
computer_engineering_major

1

In [83]:
data_structures_course = add_course("Data Structures", 3, 0)
data_structures_course

1

In [84]:
jake_taylor_professor = add_professor(
    "Jake",
    "Taylor",
    date(1980, 2, 27),
    "Some address idk",
    "vip@prof.co.uk",
    "009898989898",
    "M",
    "Computer Professor",
    3,
)
jake_taylor_professor

1

In [85]:
tuesday_data_structures_course_group = add_course_group(
    4,
    120,
    3,
    time(10, 0, 0),
    time(12, 0, 0),
    jake_taylor_professor,
    data_structures_course,
)
tuesday_data_structures_course_group

1

In [86]:
ahmed_adams_student = add_student(
    "Ahmed",
    "Adams",
    date(2004, 12, 7),
    "Some other address idk",
    "rando@gmail.com",
    "00184736",
    "M",
    3,
)
ahmed_adams_student

1

In [87]:
adams_computer_engineering_enrollment = add_enrollment(
    ahmed_adams_student, computer_engineering_major
)
adams_computer_engineering_enrollment

1

In [88]:
adams_tuesday_data_structures_study = add_study(
    None, ahmed_adams_student, tuesday_data_structures_course_group
)
adams_tuesday_data_structures_study

1

In [89]:
update_study_grade(adams_tuesday_data_structures_study, 20)

In [90]:
with connect() as conn:
    with conn.cursor() as cur:
        cur.execute('SELECT * FROM Student WHERE f_name = "Ahmed"')
        result = pd.DataFrame(cur.fetchall())

result

,id,f_name,l_name,birth,address,email,phone,gender,first_term
0,1,Ahmed,Adams,2004-12-07,Some other address idk,rando@gmail.com,00184736,M,3

In [94]:
with connect() as conn:
    with conn.cursor() as cur:
        cur.execute(
            """SELECT s.grade, c.name, cg.term, (c.theoretical_units + c.practical_units) as units
               FROM Study as s
               INNER JOIN CourseGroup as cg
               ON cg.id = s.course_group_id
               INNER JOIN Course as c
               ON c.id = cg.course_id
               WHERE s.student_id = %s
            """,
            [ahmed_adams_student],
        )
        grades_of_ahmed_adams = pd.DataFrame(cur.fetchall())

grades_of_ahmed_adams

   grade             name  term  units
0  20.00  Data Structures     4      3

In [95]:
with connect() as conn:
    with conn.cursor() as cur:
        cur.execute(
            """SELECT s.grade, st.f_name, st.l_name
               FROM Study as s
               INNER JOIN Student as st
               ON st.id = s.student_id
               WHERE s.course_group_id = %s
            """,
            [tuesday_data_structures_course_group],
        )
        grades_of_tuesday_data_structures = pd.DataFrame(cur.fetchall())

grades_of_tuesday_data_structures

   grade f_name l_name
0  20.00  Ahmed  Adams